"""
菜单

打印出菜单提供用户选择
"""


def show_menu1():
    print("+------------------------------+")
    print("| 1) 添加学生生信息            |")
    print("| 2) 查看学生信息              |")
    print("| 3) 修改学生信息              |")
    print("| 4) 删除学生信息              |")
    print("| 5) 保存信息到文件(db.txt)    |")
    print("| 6) 从文件中读取数据(db.txt)  |")
    print("| q) 退出                      |")
    print("+------------------------------+")


def show_menu2():
    print("+------------------------------+")
    print("| 1) 查看所有学生信息          |")
    print("| 2) 按成绩从高至低打印学生信息|")
    print("| 3) 按成绩从低至高打印学生信息|")
    print("| 4) 按年龄从大至小打印学生信息|")
    print("| 5) 按年龄从小至大打印学生信息|")
    print("+------------------------------+")

print("show_menu被调用")

